skuep/AIOC/stm32/aioc-fw/Src/usb_audio.c
      case AUDIO_CS_CTRL_CLK_VALID:
        // Only cur attribute exists for this request
        TU_LOG2("    Get Mic Sample Freq. valid\r\n");

        uint8_t clkValid = 1;
        return tud_control_xfer(rhport, p_request, &clkValid, sizeof(clkValid));

      // Unknown/Unsupported control
      default:
        TU_BREAKPOINT();
        return false;
    }
  }

  // Clock Source unit
  if ( entityID == AUDIO_CTRL_ID_SPK_CLOCK )
  {
    switch ( ctrlSel )
    {
      case AUDIO_CS_CTRL_SAM_FREQ:
        // channelNum is always zero in this case
        switch ( p_request->bRequest )
        {
          case AUDIO_CS_REQ_CUR:
            TU_LOG2("    Get Spk. Sample Freq.\r\n");
            return tud_control_xfer(rhport, p_request, &speakerSampleFreq, sizeof(speakerSampleFreq));

          case AUDIO_CS_REQ_RANGE:
            TU_LOG2("    Get Spk. Sample Freq. range\r\n");
            return tud_control_xfer(rhport, p_request, &sampleFreqRng, sizeof(sampleFreqRng));

           // Unknown/Unsupported control
          default:
            TU_BREAKPOINT();
            return false;
        }
      break;

      case AUDIO_CS_CTRL_CLK_VALID:
        // Only cur attribute exists for this request
        TU_LOG2("    Get Spk. Sample Freq. valid\r\n");

        uint8_t clkValid = 1;
        return tud_control_xfer(rhport, p_request, &clkValid, sizeof(clkValid));

      // Unknown/Unsupported control
      default:
        TU_BREAKPOINT();
        return false;
    }
  }

  TU_LOG2("  Unsupported entity: %d\r\n", entityID);
  return false;     // Yet not implemented
}

bool tud_audio_tx_done_pre_load_cb(uint8_t rhport, uint8_t itf, uint8_t ep_in, uint8_t cur_alt_setting) {
    (void) rhport;
    (void) itf;
    (void) ep_in;
    (void) cur_alt_setting;

    if (microphoneState == STATE_START) {
        /* Start ADC sampling as soon as device stacks starts loading data (will be a ZLP for first frame) */
        uint8_t rxGainSetting = (settingsRegMap[SETTINGS_REG_AUDIO_RX] & SETTINGS_REG_AUDIO_RX_RXGAIN_MASK) >> SETTINGS_REG_AUDIO_RX_RXGAIN_OFFS;
        usb_audio_rxgain_t rxGain =
                (rxGainSetting == SETTINGS_REG_AUDIO_RX_RXGAIN_1X_ENUM) ? USB_AUDIO_RXGAIN_1X :
                (rxGainSetting == SETTINGS_REG_AUDIO_RX_RXGAIN_2X_ENUM) ? USB_AUDIO_RXGAIN_2X :
                (rxGainSetting == SETTINGS_REG_AUDIO_RX_RXGAIN_4X_ENUM) ? USB_AUDIO_RXGAIN_4X :
                (rxGainSetting == SETTINGS_REG_AUDIO_RX_RXGAIN_8X_ENUM) ? USB_AUDIO_RXGAIN_8X :
                (rxGainSetting == SETTINGS_REG_AUDIO_RX_RXGAIN_16X_ENUM) ? USB_AUDIO_RXGAIN_16X :
                USB_AUDIO_RXGAIN_1X;

        RX_Config(rxGain);

        NVIC_EnableIRQ(ADC1_2_IRQn);
        microphoneState = STATE_RUN;

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO0] = (settingsRegMap[SETTINGS_REG_INFO_AUDIO0] & ~SETTINGS_REG_INFO_AUDIO0_RECSTATE_MASK)
                                               | (((uint32_t) SETTINGS_REG_INFO_AUDIO0_RECSTATE_RUN_ENUM) << SETTINGS_REG_INFO_AUDIO0_RECSTATE_OFFS);
    }

    return true;
}

bool tud_audio_rx_done_post_read_cb(uint8_t rhport, uint16_t n_bytes_received, uint8_t func_id, uint8_t ep_out, uint8_t cur_alt_setting)
{
    /* Get number of total bytes available in FIFO */
    uint16_t count = tud_audio_available();

    /* Calculate min/max/average statistics of buffer fill level */
    if ( (count - n_bytes_received) < speakerBufferLvlMin) speakerBufferLvlMin = count - n_bytes_received;
    if ( count > speakerBufferLvlMax) speakerBufferLvlMax = count;
    speakerBufferLvlAvg = ((uint64_t) speakerBufferLvlAvg * (65536 - SPEAKER_BUFFERLVL_AVG) + ((uint64_t) count << 16) * SPEAKER_BUFFERLVL_AVG) / 65536.0;

    if (speakerState == STATE_START) {
        if (count >= SPEAKER_BUFFERLVL_TARGET) {
            /* Wait until we are at buffer target fill level, then start DAC output */
            speakerState = STATE_RUN;
            TX_Config((settingsRegMap[SETTINGS_REG_AUDIO_TX] & SETTINGS_REG_AUDIO_TX_TXBOOST_MASK) ? USB_AUDIO_TXBOOST_ON : USB_AUDIO_TXBOOST_OFF);
            NVIC_EnableIRQ(TIM6_DAC1_IRQn);

            /* Update debug register */
            settingsRegMap[SETTINGS_REG_INFO_AUDIO0] = (settingsRegMap[SETTINGS_REG_INFO_AUDIO0] & ~SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_MASK)
                                                   | (((uint32_t) SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_RUN_ENUM) << SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_OFFS);
        }

        /* Initialize/override min/max/avg during startup buffering */
        speakerBufferLvlAvg = count;
        speakerBufferLvlMin = count;
        speakerBufferLvlMax = count;
    }

    /* Write to debug registers */
    settingsRegMap[SETTINGS_REG_INFO_AUDIO10] = ((uint32_t) (speakerBufferLvlAvg >> 16) << SETTINGS_REG_INFO_AUDIO10_PLAYBUFAVG_OFFS) & SETTINGS_REG_INFO_AUDIO10_PLAYBUFAVG_MASK;
    settingsRegMap[SETTINGS_REG_INFO_AUDIO11] = ((uint32_t) speakerBufferLvlMin         << SETTINGS_REG_INFO_AUDIO11_PLAYBUFMIN_OFFS) & SETTINGS_REG_INFO_AUDIO11_PLAYBUFMIN_MASK;
    settingsRegMap[SETTINGS_REG_INFO_AUDIO12] = ((uint32_t) speakerBufferLvlMax         << SETTINGS_REG_INFO_AUDIO12_PLAYBUFMAX_OFFS) & SETTINGS_REG_INFO_AUDIO12_PLAYBUFMAX_MASK;

    return true;
}


bool tud_audio_set_itf_cb(uint8_t rhport, tusb_control_request_t const * p_request)
{
    (void) rhport;
    (void) p_request;

    uint16_t itf = p_request->wIndex;
    uint16_t alt = p_request->wValue;

    switch(itf) {
    case ITF_NUM_AUDIO_STREAMING_IN:
        if (alt == 1) {
            /* Microphone channel has been activated */
            microphoneState = STATE_START;

            /* Update VCOS/VPTT timeouts */
            Timeout_Timers_Init();

            /* Update debug register */
            settingsRegMap[SETTINGS_REG_INFO_AUDIO0] = (settingsRegMap[SETTINGS_REG_INFO_AUDIO0] & ~SETTINGS_REG_INFO_AUDIO0_RECSTATE_MASK)
                                                   | (((uint32_t) SETTINGS_REG_INFO_AUDIO0_RECSTATE_START_ENUM) << SETTINGS_REG_INFO_AUDIO0_RECSTATE_OFFS);
        }
        break;

