skuep/AIOC/stm32/aioc-fw/Src/usb_audio.c
    case ITF_NUM_AUDIO_STREAMING_OUT:
        if (alt == 1) {
            /* Speaker channel has been activated */
            speakerState = STATE_START;

            /* Update VCOS/VPTT timeouts */
            Timeout_Timers_Init();

            /* Update debug register */
            settingsRegMap[SETTINGS_REG_INFO_AUDIO0] = (settingsRegMap[SETTINGS_REG_INFO_AUDIO0] & ~SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_MASK)
                                                   | (((uint32_t) SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_START_ENUM) << SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_OFFS);
        }
        break;

    default:
        TU_ASSERT(0, false);
        break;
    }

    return true;
}

bool tud_audio_set_itf_close_EP_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
    (void) rhport;
    (void) p_request;

    uint16_t itf = p_request->wIndex;

    switch (itf) {
    case ITF_NUM_AUDIO_STREAMING_IN:
        /* Microphone channel has been stopped */
        NVIC_DisableIRQ(ADC1_2_IRQn);
        microphoneState = STATE_OFF;

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO0] = (settingsRegMap[SETTINGS_REG_INFO_AUDIO0] & ~SETTINGS_REG_INFO_AUDIO0_RECSTATE_MASK)
                                               | (((uint32_t) SETTINGS_REG_INFO_AUDIO0_RECSTATE_OFF_ENUM) << SETTINGS_REG_INFO_AUDIO0_RECSTATE_OFFS);
        break;

    case ITF_NUM_AUDIO_STREAMING_OUT:
        /* Speaker channel has been stopped */
        NVIC_DisableIRQ(TIM6_DAC1_IRQn);
        speakerState = STATE_OFF;

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO0] = (settingsRegMap[SETTINGS_REG_INFO_AUDIO0] & ~SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_MASK)
                                               | (((uint32_t) SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_OFF_ENUM) << SETTINGS_REG_INFO_AUDIO0_PLAYSTATE_OFFS);
        break;

    default:
        TU_ASSERT(0, false);
        break;
    }

    return true;
}

void tud_audio_feedback_params_cb(uint8_t func_id, uint8_t alt_itf, audio_feedback_params_t* feedback_param)
{
    /* Configure parameters for feedback endpoint */
    feedback_param->frequency.mclk_freq = USB_SOF_TIMER_HZ;
    feedback_param->sample_freq = speakerSampleFreqCfg;
    feedback_param->method = AUDIO_FEEDBACK_METHOD_FREQUENCY_FIXED;
}

bool tud_audio_feedback_format_correction_cb(uint8_t func_id)
{
    /* Use the quirk detection to detect whether we need format correction (10.14) according to the USB specification (MacOS)
     * or whether we use no correction (16.16) as a quirk (Windows). Linux works either way. */
    if (tud_speed_get() == TUSB_SPEED_FULL) {
        return USB_DescUAC2Quirk() ? false : true;
    } else {
        return false;
    }
}

TU_ATTR_FAST_FUNC void tud_audio_feedback_interval_isr(uint8_t func_id, uint32_t frame_number, uint8_t interval_shift)
{
    static uint32_t prev_cycles = 0;
    uint32_t this_cycles = USB_SOF_TIMER_CNT;
    uint32_t feedback;

    /* Calculate number of master clock cycles between now and last call */
    uint32_t cycles = (uint32_t) (((uint64_t) this_cycles - prev_cycles) & 0xFFFFFFFFUL);
    TU_ASSERT(cycles != 0, /**/);
    /* Prepare for next time */
    prev_cycles = this_cycles;

    /* Calculate the feedback value, taken from tinyusb stack */
    uint64_t fb64 = (((uint64_t) cycles) * speakerSampleFreqCfg) << 16;
    feedback = (uint32_t) (fb64 / USB_SOF_TIMER_HZ);

    /* Couple the buffer level bias to the feedback value to avoid buffer drift */
    if (speakerState == STATE_RUN) {
        int32_t bias = (int32_t) speakerBufferLvlAvg - ((int32_t) SPEAKER_BUFFERLVL_TARGET << 16); /* 16.16 format same as feedback */
        feedback -= ((int64_t) bias * SPEAKER_BUFLVL_FB_COUPLING) / 65536;
    }

    /* The size of isochronous packets created by the device must be within the limits specified in FMT-2.0 section 2.3.1.1.
     * This means that the deviation of actual packet size from nominal size must not exceed +/- one audio slot
     * (audio slot = channel count samples). */
    uint32_t sampleFreq = speakerSampleFreq;
    uint32_t min_value = (sampleFreq/1000 - 1) << 16; /* 1000 for full-speed USB */
    uint32_t max_value = (sampleFreq/1000 + 1) << 16;

    /* Limit */
    if ( feedback > max_value ) feedback = max_value;
    if ( feedback < min_value ) feedback = min_value;

    /* Send to host */
    tud_audio_n_fb_set(func_id, feedback);

    /* Handle min/max/avg statistics */
    if (feedback < speakerFeedbackMin) speakerFeedbackMin = feedback;
    if (feedback > speakerFeedbackMax) speakerFeedbackMax = feedback;
    speakerFeedbackAvg = (speakerFeedbackAvg * (65536 - SPEAKER_FEEDBACK_AVG) + ((uint64_t) feedback << 16) * SPEAKER_FEEDBACK_AVG) / 65536.0;

    if (speakerState == STATE_START) {
        /* Initialize/overwrite min/max/avg during start */
        speakerFeedbackAvg = (uint64_t) feedback << 16;
        speakerFeedbackMin = feedback;
        speakerFeedbackMax = feedback;
    }

    /* Write to debug registers */
    settingsRegMap[SETTINGS_REG_INFO_AUDIO13] = ((uint32_t) (speakerFeedbackAvg >> 16) << SETTINGS_REG_INFO_AUDIO13_PLAYFBAVG_OFFS) & SETTINGS_REG_INFO_AUDIO13_PLAYFBAVG_MASK;
    settingsRegMap[SETTINGS_REG_INFO_AUDIO14] = ((uint32_t) speakerFeedbackMin         << SETTINGS_REG_INFO_AUDIO14_PLAYFBMIN_OFFS) & SETTINGS_REG_INFO_AUDIO14_PLAYFBMIN_MASK;
    settingsRegMap[SETTINGS_REG_INFO_AUDIO15] = ((uint32_t) speakerFeedbackMax         << SETTINGS_REG_INFO_AUDIO15_PLAYFBMAX_OFFS) & SETTINGS_REG_INFO_AUDIO15_PLAYFBMAX_MASK;
}

void ADC1_2_IRQHandler (void)
{
    if ( (ADC1->ISR & ADC_ISR_EOS) || (ADC2->ISR & ADC_ISR_EOS) ) {
        int16_t sample = 0;

        /* Get ADC sample */
        if (ADC1->ISR & ADC_ISR_EOS) {
            ADC1->ISR = ADC_ISR_EOS;
            sample = ((int32_t) ADC1->DR - 32768) & 0xFFFFU;
        }

        if (ADC2->ISR & ADC_ISR_EOS) {
            ADC2->ISR = ADC_ISR_EOS;
            sample = ((int32_t) ADC2->DR - 32768) & 0xFFFFU;
        }

        /* Automatic COS */
        uint16_t cosThreshold = (settingsRegMap[SETTINGS_REG_VCOS_LVLCTRL] & SETTINGS_REG_VCOS_LVLCTRL_THRSHLD_MASK) >> SETTINGS_REG_VCOS_LVLCTRL_THRSHLD_OFFS;

        if (!microphoneMute[1] && ( (sample > cosThreshold) || (sample < -cosThreshold) )) {
            /* Reset timeout and make sure timer is enabled */
            TIM17->EGR = TIM_EGR_UG; /* Generate an update event in the timer */
        }

        /* Get volume */
        uint16_t volume = !microphoneMute[1] ? microphoneLinVolume[1] : 0;

