skuep/AIOC/stm32/aioc-fw/Src/usb_audio.c
        /* Scale with 16-bit unsigned volume and round */
        sample = (int16_t) (((int32_t) sample * volume + (sample > 0 ? 32768 : -32768)) / 65536);

        /* Store in FIFO */
        tud_audio_write (&sample, sizeof(sample));
    }
}

void TIM6_DAC_IRQHandler(void)
{
    if (TIM6->SR & TIM_SR_UIF) {
        TIM6->SR = (uint32_t) ~TIM_SR_UIF;

        if (fox_hunt_output() != 0)
        	return;

        int16_t sample = 0x0000;

        /* Read from FIFO, leave sample at 0 if fifo empty */
        tud_audio_read(&sample, sizeof(sample));

        /* Automatic PTT */
        uint16_t pttThreshold = (settingsRegMap[SETTINGS_REG_VPTT_LVLCTRL] & SETTINGS_REG_VPTT_LVLCTRL_THRSHLD_MASK) >> SETTINGS_REG_VPTT_LVLCTRL_THRSHLD_OFFS;

        if (!speakerMute[1] && ( (sample > pttThreshold) || (sample < -pttThreshold) )) {
            /* Reset timeout and make sure timer is enabled */
            TIM16->EGR = TIM_EGR_UG; /* Generate an update event in the timer */
        }

        /* Get volume */
        uint16_t volume = !speakerMute[1] ? speakerLinVolume[1] : 0;

        /* Scale with 16-bit unsigned volume and round */
        sample = (int16_t) (((int32_t) sample * volume + (sample > 0 ? 32768 : -32768)) / 65536);

        /* Load DAC holding register with sample */
        DAC1->DHR12L1 = ((int32_t) sample + 32768) & 0xFFFFU;
    }
}

void TIM16_IRQHandler(void)
{
    /* This is a timeout counter for the automatic PTT function */
    uint32_t flags = TIM16->SR;

    if (flags & TIM_SR_UIF) {
        /* Timer was reset (via the EGR register). */
        uint32_t cr = TIM16->CR1;
        if (!(cr & TIM_CR1_CEN)) {
            /* If timer was not enabled previously, enable timer and assert PTT */
            TIM16->CR1 = cr | TIM_CR1_CEN;

            /* Update debug register */
            settingsRegMap[SETTINGS_REG_INFO_AUDIO0] |= SETTINGS_REG_INFO_AIOC0_VPTTSTATE_MASK;

            /* Assert enabled PTTs */
            uint8_t pttMask = IO_PTT_MASK_NONE;
            pttMask |= settingsRegMap[SETTINGS_REG_AIOC_IOMUX0] & SETTINGS_REG_AIOC_IOMUX0_OUT1SRC_VPTT_MASK ? IO_PTT_MASK_PTT1 : 0;
            pttMask |= settingsRegMap[SETTINGS_REG_AIOC_IOMUX1] & SETTINGS_REG_AIOC_IOMUX1_OUT2SRC_VPTT_MASK ? IO_PTT_MASK_PTT2 : 0;

            IO_PTTAssert(pttMask);
        }
    } else if (flags & TIM_SR_CC1IF) {
        /* The idle timeout (without any action on the DAC) was reached. Disable timer and deassert PTT */
        TIM16->CR1 &= ~TIM_CR1_CEN;

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO0] &= ~SETTINGS_REG_INFO_AIOC0_VPTTSTATE_MASK;

        /* Deassert enabled PTTs */
        uint8_t pttMask = IO_PTT_MASK_NONE;
        pttMask |= settingsRegMap[SETTINGS_REG_AIOC_IOMUX0] & SETTINGS_REG_AIOC_IOMUX0_OUT1SRC_VPTT_MASK ? IO_PTT_MASK_PTT1 : 0;
        pttMask |= settingsRegMap[SETTINGS_REG_AIOC_IOMUX1] & SETTINGS_REG_AIOC_IOMUX1_OUT2SRC_VPTT_MASK ? IO_PTT_MASK_PTT2 : 0;

        IO_PTTDeassert(pttMask);
    }

    TIM16->SR = ~flags;
}

void TIM17_IRQHandler(void)
{
    /* This is a timeout counter for the automatic COS function */
    uint32_t flags = TIM17->SR;

    if (flags & TIM_SR_UIF) {
        /* Timer was reset (via the EGR register). */
        uint32_t cr = TIM17->CR1;
        if (!(cr & TIM_CR1_CEN)) {
            /* If timer was not enabled previously, enable timer and notify host of COS */
            TIM17->CR1 = cr | TIM_CR1_CEN;

            /* Update debug register */
            settingsRegMap[SETTINGS_REG_INFO_AUDIO0] |= SETTINGS_REG_INFO_AIOC0_VCOSSTATE_MASK;

            /* Set COS state */
            COS_VirtualSetState(0x01);
        }
    } else if (flags & TIM_SR_CC1IF) {
        /* The idle timeout (without any action on the ADC) was reached. Disable timer and notify host */
        TIM17->CR1 &= ~TIM_CR1_CEN;

        /* Update debug register */
        settingsRegMap[SETTINGS_REG_INFO_AUDIO0] &= ~SETTINGS_REG_INFO_AIOC0_VCOSSTATE_MASK;

        /* Set COS state */
        COS_VirtualSetState(0x00);
    }

    TIM17->SR = ~flags;
}

static void GPIO_Init(void)
{
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    GPIO_InitTypeDef ADCInGpio;
    ADCInGpio.Pin = GPIO_PIN_2;
    ADCInGpio.Mode = GPIO_MODE_ANALOG;
    ADCInGpio.Pull = GPIO_NOPULL;
    ADCInGpio.Speed = GPIO_SPEED_FREQ_LOW;
    ADCInGpio.Alternate = 0;
    HAL_GPIO_Init(GPIOB, &ADCInGpio);

    GPIO_InitTypeDef OPAMP1InGpio;
    OPAMP1InGpio.Pin = GPIO_PIN_5;
    OPAMP1InGpio.Mode = GPIO_MODE_ANALOG;
    OPAMP1InGpio.Pull = GPIO_NOPULL;
    OPAMP1InGpio.Speed = GPIO_SPEED_FREQ_LOW;
    OPAMP1InGpio.Alternate = 0;
    HAL_GPIO_Init(GPIOA, &OPAMP1InGpio);

    GPIO_InitTypeDef OPAMP2OutGpio;
    OPAMP2OutGpio.Pin = GPIO_PIN_6;
    OPAMP2OutGpio.Mode = GPIO_MODE_ANALOG;
    OPAMP2OutGpio.Pull = GPIO_NOPULL;
    OPAMP2OutGpio.Speed = GPIO_SPEED_FREQ_LOW;
    OPAMP2OutGpio.Alternate = 0;
    HAL_GPIO_Init(GPIOA, &OPAMP2OutGpio);

    GPIO_InitTypeDef SamplerateGpio;
    SamplerateGpio.Pin = GPIO_PIN_0;
    SamplerateGpio.Mode = GPIO_MODE_AF_PP;
    SamplerateGpio.Pull = GPIO_NOPULL;
    SamplerateGpio.Speed = GPIO_SPEED_FREQ_HIGH;
    SamplerateGpio.Alternate = GPIO_AF2_TIM3;
    HAL_GPIO_Init(GPIOB, &SamplerateGpio);

    GPIO_InitTypeDef DACOutGpio;
    DACOutGpio.Pin = GPIO_PIN_4;
    DACOutGpio.Mode = GPIO_MODE_ANALOG;
    DACOutGpio.Pull = GPIO_NOPULL;
    DACOutGpio.Speed = GPIO_SPEED_FREQ_LOW;
    DACOutGpio.Alternate = 0;
    HAL_GPIO_Init(GPIOA, &DACOutGpio);

    GPIO_InitTypeDef DACAttenGpio;
    DACAttenGpio.Pin = GPIO_PIN_3;
    DACAttenGpio.Mode = GPIO_MODE_OUTPUT_OD;
    DACAttenGpio.Pull = GPIO_NOPULL;
    DACAttenGpio.Speed = GPIO_SPEED_FREQ_LOW;
    DACAttenGpio.Alternate = 0;
    HAL_GPIO_Init(GPIOA, &DACAttenGpio);
}

static void Timer_ADC_Init(void)
{
	/* Calculate clock rate divider for requested sample rate with rounding */
	uint32_t timerFreq = (HAL_RCC_GetHCLKFreq() == HAL_RCC_GetPCLK1Freq()) ? HAL_RCC_GetPCLK1Freq() : 2 * HAL_RCC_GetPCLK1Freq();
	uint32_t rateDivider = (timerFreq + microphoneSampleFreq / 2) / microphoneSampleFreq;

	/* Store actually realized samplerate */
	microphoneSampleFreqCfg = timerFreq / rateDivider;

