skuep/AIOC/stm32/aioc-fw/Src/usb_audio.c
	/* Enable clock and (re-) initialize timer */
    __HAL_RCC_TIM3_CLK_ENABLE();

    /* TIM3_TRGO triggers ADC2 */
    TIM3->CR1 &= ~TIM_CR1_CEN;
    TIM3->CR1 = TIM_CLOCKDIVISION_DIV1 | TIM_COUNTERMODE_UP | TIM_AUTORELOAD_PRELOAD_ENABLE;
    TIM3->CR2 = TIM_TRGO_UPDATE;
    TIM3->PSC = 0;
    TIM3->ARR = rateDivider - 1;
    TIM3->EGR = TIM_EGR_UG;
#if 1 /* Output sample rate on compare channel 3 */
    TIM3->CCMR2 =  TIM_OCMODE_PWM1 | TIM_CCMR2_OC3PE;
    TIM3->CCER = (0 << TIM_CCER_CC3P_Pos) | TIM_CCER_CC3E;
    TIM3->CCR3 = rateDivider/2 - 1;
#endif
    TIM3->CR1 |= TIM_CR1_CEN;
}

static void Timer_DAC_Init(void)
{
    /* Calculate clock rate divider for requested sample rate with rounding */
    uint32_t timerFreq = (HAL_RCC_GetHCLKFreq() == HAL_RCC_GetPCLK1Freq()) ? HAL_RCC_GetPCLK1Freq() : 2 * HAL_RCC_GetPCLK1Freq();
    uint32_t rateDivider = (timerFreq + speakerSampleFreq / 2) / speakerSampleFreq;

    /* Store actually realized samplerate for feedback algorithm to use */
    speakerSampleFreqCfg = timerFreq / rateDivider;

    /* Enable clock and (re-) initialize timer */
    __HAL_RCC_TIM6_CLK_ENABLE();

    /* TIM6_TRGO triggers DAC */
    TIM6->CR1 &= ~TIM_CR1_CEN;
    TIM6->CR1 = TIM_CLOCKDIVISION_DIV1 | TIM_COUNTERMODE_UP | TIM_AUTORELOAD_PRELOAD_ENABLE;
    TIM6->CR2 = TIM_TRGO_UPDATE;
    TIM6->PSC = 0;
    TIM6->ARR = rateDivider - 1;
    TIM6->EGR = TIM_EGR_UG;

    TIM6->DIER = TIM_DIER_UIE;
    TIM6->CR1 |= TIM_CR1_CEN;

    NVIC_SetPriority(TIM6_DAC1_IRQn, AIOC_IRQ_PRIO_AUDIO);
}

static void ADC_Init(void)
{
    /* We use two ADCs. ADC1 is used, when OPAMP(PGA) is used. Otherwise ADC2 with direct hardware connection is used */
    __HAL_RCC_ADC1_CLK_ENABLE();
    __HAL_RCC_ADC2_CLK_ENABLE();

    ADC1->CR = 0x00 << ADC_CR_ADVREGEN_Pos;
    ADC2->CR = 0x00 << ADC_CR_ADVREGEN_Pos;
    ADC1->CR = 0x01 << ADC_CR_ADVREGEN_Pos;
    ADC2->CR = 0x01 << ADC_CR_ADVREGEN_Pos;

    for (uint32_t i=0; i<200; i++) {
        asm volatile ("nop");
    }

    /* Select AHB clock */
    ADC12_COMMON->CCR = (0x1 << ADC12_CCR_CKMODE_Pos) | (0x00 << ADC12_CCR_MULTI_Pos);

    ADC1->CR |= ADC_CR_ADCAL;
    ADC2->CR |= ADC_CR_ADCAL;

    while ( (ADC1->CR & ADC_CR_ADCAL) || (ADC2->CR & ADC_CR_ADCAL) )
        ;

    ADC1->CR |= ADC_CR_ADEN;
    ADC2->CR |= ADC_CR_ADEN;

    /* Wait for ADC to be ready */
    while (!(ADC1->ISR & ADC_ISR_ADRDY) || !(ADC2->ISR & ADC_ISR_ADRDY) )
        ;

    /* External Trigger on TIM3_TRGO, left aligned data with 12 bit resolution */
    ADC1->CFGR = (0x01 << ADC_CFGR_EXTEN_Pos)  | (0x04 << ADC_CFGR_EXTSEL_Pos) | (ADC_CFGR_ALIGN) | (0x00 << ADC_CFGR_RES_Pos);
    ADC2->CFGR = (0x01 << ADC_CFGR_EXTEN_Pos)  | (0x04 << ADC_CFGR_EXTSEL_Pos) | (ADC_CFGR_ALIGN) | (0x00 << ADC_CFGR_RES_Pos);

    /* Maximum sample time of 601.5 cycles for channel 3/channel 12. */
    ADC1->SMPR1 = 0x7 << ADC_SMPR1_SMP3_Pos;
    ADC2->SMPR2 = 0x7 << ADC_SMPR2_SMP12_Pos;

    /* Sample only channel 3/channel 12 in a regular sequence */
    ADC1->SQR1 = ( 3 << ADC_SQR1_SQ1_Pos) | (0 << ADC_SQR1_L_Pos);
    ADC2->SQR1 = (12 << ADC_SQR1_SQ1_Pos) | (0 << ADC_SQR1_L_Pos);

    /* Enable Interrupt Request */
    ADC1->IER = ADC_IER_EOSIE;
    ADC2->IER = ADC_IER_EOSIE;

    NVIC_SetPriority(ADC1_2_IRQn, AIOC_IRQ_PRIO_AUDIO);
}

static void DAC_Init(void)
{
    __HAL_RCC_DAC1_CLK_ENABLE();

    /* Select TIM6 TRGO as trigger and enable DAC */
    DAC->CR = (0x0 << DAC_CR_TSEL1_Pos) | DAC_CR_TEN1 | DAC_CR_EN1;

    /* Output VDD/2 */
    DAC1->DHR12L1 = 32768;
}

static void RX_Config(usb_audio_rxgain_t rxGain)
{
    /* Disable OPAMPs */
    OPAMP1->CSR = 0x00;
    OPAMP2->CSR = 0x00;

    if (rxGain == USB_AUDIO_RXGAIN_1X) {
        /* Legacy mode that is compatible with pre-v1.2 hardware */
        OPAMP2->CSR = OPAMP_FOLLOWER_MODE | OPAMP_VREF_50VDDA | OPAMP_CSR_FORCEVP | OPAMP2_CSR_OPAMP2EN; /* 50% VDD for bias */

        /* Start ADC2 with direct hardware ADC input (no PGA in between) */
        if (ADC1->CR & ADC_CR_ADSTART)      ADC1->CR |= ADC_CR_ADSTP;
        if (!(ADC2->CR & ADC_CR_ADSTART))   ADC2->CR |= ADC_CR_ADSTART;
    } else {
        /* Initialize OPAMPs so that OPAMP1 is a PGA (non inverting) and OPAMP2 produces the correct DC-bias voltage according to OPAMP1 gain. */
        static const uint32_t pgaConfig[] = {
            [USB_AUDIO_RXGAIN_2X] = OPAMP_PGA_MODE | OPAMP_PGA_GAIN_2,          /* ADCin: 0.825V +/- 0.825V */
            [USB_AUDIO_RXGAIN_4X] = OPAMP_PGA_MODE | OPAMP_PGA_GAIN_4,          /* ADCin: 0.4125V +/- 0.4125V */
            [USB_AUDIO_RXGAIN_8X] = OPAMP_PGA_MODE | OPAMP_PGA_GAIN_8,          /* ADCin: 0.20625V +/- 0.20625V */
            [USB_AUDIO_RXGAIN_16X] = OPAMP_PGA_MODE | OPAMP_PGA_GAIN_16         /* ADCin: 0.103125V +/- 0.103125V */
        };

        static const uint32_t biasConfig[] = {
            [USB_AUDIO_RXGAIN_2X] = OPAMP_PGA_MODE | OPAMP_PGA_GAIN_8,          /* 3.3V * 3.3% * 8 = 0.8712V */
            [USB_AUDIO_RXGAIN_4X] = OPAMP_PGA_MODE | OPAMP_PGA_GAIN_4,          /* 3.3V * 3.3% * 4 = 0.4356V */
            [USB_AUDIO_RXGAIN_8X] = OPAMP_PGA_MODE | OPAMP_PGA_GAIN_2,          /* 3.3V * 3.3% * 2 = 0.2178V */
            [USB_AUDIO_RXGAIN_16X] = OPAMP_FOLLOWER_MODE                        /* 3.3V * 3.3% * 1 = 0.1089V */
        };

        /* Set up OPAMP1 PGA */
        OPAMP1->CSR = pgaConfig[rxGain] | OPAMP_NONINVERTINGINPUT_IO3 | OPAMP1_CSR_OPAMP1EN;

        /* Add a trimming offset adjustment to get closer to the required bias voltage reference of 1.65V/16 = 103mV.
         * Default setting is 3.3V * 3.3% = 109mV.
         * These return the factory trim values, because the CSR register (and thus the USERTRIM bit) is 0 */
        uint32_t trimmingOffsetP2 = (OPAMP2->CSR & OPAMP2_CSR_TRIMOFFSETP_Msk) >> OPAMP2_CSR_TRIMOFFSETP_Pos;
        uint32_t trimmingOffsetN2 = (OPAMP2->CSR & OPAMP2_CSR_TRIMOFFSETN_Msk) >> OPAMP2_CSR_TRIMOFFSETN_Pos;
        int8_t trimAdjust = 7; /* Found empirically. It looks like 1 step amounts to roughly 1mV input offset */

        /* Observe the register limits, do saturated arithmetic */
        trimmingOffsetP2 = (((int32_t) trimmingOffsetP2 + trimAdjust) <= 0x1F) ? trimmingOffsetP2 + trimAdjust : 0x1F;
        trimmingOffsetN2 = (((int32_t) trimmingOffsetN2 - trimAdjust) >= 0x00) ? trimmingOffsetN2 - trimAdjust : 0x00;

