skuep/AIOC/stm32/aioc-fw/Src/usb_audio.c
        /* Set up OPAMP2 bias voltage generation, disable the factory trimming */
        OPAMP2->CSR = biasConfig[rxGain] | OPAMP_VREF_3VDDA | OPAMP_CSR_FORCEVP | OPAMP2_CSR_OPAMP2EN | OPAMP_TRIMMING_USER;

        /* Load trimming values */
        OPAMP2->CSR |= (OPAMP2->CSR & ~(OPAMP2_CSR_TRIMOFFSETP_Msk | OPAMP2_CSR_TRIMOFFSETN_Msk)) |
                ((trimmingOffsetP2 << OPAMP2_CSR_TRIMOFFSETP_Pos) & OPAMP2_CSR_TRIMOFFSETP_Msk) |
                ((trimmingOffsetN2 << OPAMP2_CSR_TRIMOFFSETN_Pos) & OPAMP2_CSR_TRIMOFFSETN_Msk);

        /* Start ADC1 using PGA output as ADC input */
        if (ADC2->CR & ADC_CR_ADSTART)      ADC2->CR |= ADC_CR_ADSTP;
        if (!(ADC1->CR & ADC_CR_ADSTART))   ADC1->CR |= ADC_CR_ADSTART;
    }
}

static void TX_Config(usb_audio_txboost_t txBoost)
{
    /* Set PINA3 (ATTEN Hi-Z) in TX Boost mode, reset PINA3 (pull ATTEN low) in normal mode */
    if (txBoost == USB_AUDIO_TXBOOST_ON) {
        GPIOA->BSRR = GPIO_BSRR_BS_3;
    } else {
        GPIOA->BRR = GPIO_BRR_BR_3;
    }
}

static void Timeout_Timers_Init(void)
{
    uint32_t timerFreq = (HAL_RCC_GetHCLKFreq() == HAL_RCC_GetPCLK2Freq()) ? HAL_RCC_GetPCLK2Freq() : 2 * HAL_RCC_GetPCLK2Freq();
    uint32_t pttTimeout = (settingsRegMap[SETTINGS_REG_VPTT_TIMCTRL] & SETTINGS_REG_VPTT_TIMCTRL_TIMEOUT_MASK) >> SETTINGS_REG_VPTT_TIMCTRL_TIMEOUT_OFFS;
    uint32_t cosTimeout = (settingsRegMap[SETTINGS_REG_VCOS_TIMCTRL] & SETTINGS_REG_VCOS_TIMCTRL_TIMEOUT_MASK) >> SETTINGS_REG_VCOS_TIMCTRL_TIMEOUT_OFFS;

    __HAL_RCC_TIM16_CLK_ENABLE();
    __HAL_RCC_TIM17_CLK_ENABLE();

   /* TIM16 and TIM17 are timeout-counters for PTT and COS */
   TIM16->CR1 = TIM_CLOCKDIVISION_DIV1 | TIM_COUNTERMODE_UP;
   TIM16->PSC = timerFreq / 16000 - 1; /* 16 kHz counter */
   TIM16->CCR1 = pttTimeout - 1;
   TIM16->DIER = TIM_DIER_UIE | TIM_DIER_CC1IE;

   TIM17->CR1 = TIM_CLOCKDIVISION_DIV1 | TIM_COUNTERMODE_UP;
   TIM17->PSC = timerFreq / 16000 - 1; /* 16 kHz counter */
   TIM17->CCR1 = cosTimeout - 1;
   TIM17->DIER = TIM_DIER_UIE | TIM_DIER_CC1IE;

   NVIC_SetPriority(TIM16_IRQn, AIOC_IRQ_PRIO_AUDIO);
   NVIC_EnableIRQ(TIM16_IRQn);

   NVIC_SetPriority(TIM17_IRQn, AIOC_IRQ_PRIO_AUDIO);
   NVIC_EnableIRQ(TIM17_IRQn);
}

void USB_AudioInit(void)
{
    GPIO_Init();
    Timer_ADC_Init();
    Timer_DAC_Init();
    ADC_Init();
    DAC_Init();

    Timeout_Timers_Init();
}

void USB_AudioGetSpeakerFeedbackStats(usb_audio_fbstats_t * status)
{
    *status = (usb_audio_fbstats_t) {
        .feedbackMin = speakerFeedbackMin,
        .feedbackMax = speakerFeedbackMax,
        .feedbackAvg = (uint32_t) (speakerFeedbackAvg >> 16)
    };
}

void USB_AudioGetSpeakerBufferStats(usb_audio_bufstats_t * status)
{
    *status = (usb_audio_bufstats_t) {
        .bufLevelMin = speakerBufferLvlMin,
        .bufLevelMax =  speakerBufferLvlMax,
        .bufLevelAvg = (uint16_t) (speakerBufferLvlAvg >> 16)
    };

}
